2023-1/plano-ensino.tex
% Created 2023-03-21 Tue 22:51
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{header.tex}
\author{Prof. Luigi D. C. Soares}
\date{\today}
\title{Plano de Ensino}
\hypersetup{
 pdfauthor={Prof. Luigi D. C. Soares},
 pdftitle={Plano de Ensino},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.1)}, 
 pdflang={Portuges}}
\begin{document}

\begin{center}
    \Large\bfseries\thetitle{}
\end{center}

\section{Informações Gerais}
\label{sec:org4dc646b}

\begin{description}[noitemsep]
\item[{Contato:}] \href{mailto://luigi.domenico@dcc.ufmg.br}{luigi.domenico@dcc.ufmg.br}
(adicionar [PDS 2] no assunto)
\item[{Dia/Horário:}] Terça e Quinta, 07:30--09:10
\item[{Sala:}] Auditório 1 - ICEx
\end{description}

\section{Ementa}
\label{sec:org7e70cfe}

Metodologias e boas práticas de desenvolvimento de
software. Introdução à orientação a objetos.  Compreensão,
corretude e depuração de programas. Resolução de problemas
de forma modular e eficiente.

\section{Objetivos}
\label{sec:orgf0e0edd}

O objetivo da disciplina é apresentar técnicas básicas de
desenvolvimento, teste e análise de programas de computador,
para a resolução de problemas de forma eficaz. É esperado
que nesta disciplina os alunos desenvolvam seus primeiros
programas de tamanho moderado, motivando a necessidade de
uso de boas práticas de desenvolvimento, fixando os
conteúdos abordados através de atividades
práticas. Concluindo o curso, os alunos deverão dominar as
técnicas mais básicas utilizadas no processo de
desenvolvimento de software.

\section{Avaliação}
\label{sec:org8421abc}

\begin{itemize}
\item Provas teóricas (2 x 25 pontos): 50 pontos
\item Ativadades práticas: 20 pontos
\item Projeto final: 30 pontos
\end{itemize}

\section{Bibliografia}
\label{sec:orga8150d1}

\nocite{*}
\printbibliography[heading=none]
\end{document}